**ASSIGNMENT DAY 7**
lakukan pengujian hipotesis untuk 
membuktikan apakah education berpengaruh terhadap 
income atau tidak

In [1]:
import pandas as pd
import numpy as np
import scipy.stats as st

In [2]:
df = pd.read_csv('marketing_campaign.csv', sep='\t')
df.tail()

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
2235,10870,1967,Graduation,Married,61223.0,0,1,13-06-2013,46,709,...,5,0,0,0,0,0,0,3,11,0
2236,4001,1946,PhD,Together,64014.0,2,1,10-06-2014,56,406,...,7,0,0,0,1,0,0,3,11,0
2237,7270,1981,Graduation,Divorced,56981.0,0,0,25-01-2014,91,908,...,6,0,1,0,0,0,0,3,11,0
2238,8235,1956,Master,Together,69245.0,0,1,24-01-2014,8,428,...,3,0,0,0,0,0,0,3,11,0
2239,9405,1954,PhD,Married,52869.0,1,1,15-10-2012,40,84,...,7,0,0,0,0,0,0,3,11,1

**Hipotesis:**

*   H0 = Education tidak berpengaruh signifikan terhadap Income
*   H1 = Education berpengaruh signifikan terhadap Income

In [3]:
#cek ada berapa kategori Education dalam df
df['Education'].unique()

array(['Graduation', 'PhD', 'Master', 'Basic', '2n Cycle'], dtype=object)

In [4]:
#cek nilai Nan
print(df.isnull().sum())

ID                      0
Year_Birth              0
Education               0
Marital_Status          0
Income                 24
Kidhome                 0
Teenhome                0
Dt_Customer             0
Recency                 0
MntWines                0
MntFruits               0
MntMeatProducts         0
MntFishProducts         0
MntSweetProducts        0
MntGoldProds            0
NumDealsPurchases       0
NumWebPurchases         0
NumCatalogPurchases     0
NumStorePurchases       0
NumWebVisitsMonth       0
AcceptedCmp3            0
AcceptedCmp4            0
AcceptedCmp5            0
AcceptedCmp1            0
AcceptedCmp2            0
Complain                0
Z_CostContact           0
Z_Revenue               0
Response                0
dtype: int64

In [5]:
#handling missing value dengan median
df["Income"] = df["Income"].replace(np.NaN, df["Income"].median())

In [6]:
#cek kembali kondisi missing value
print(df.isnull().sum())

ID                     0
Year_Birth             0
Education              0
Marital_Status         0
Income                 0
Kidhome                0
Teenhome               0
Dt_Customer            0
Recency                0
MntWines               0
MntFruits              0
MntMeatProducts        0
MntFishProducts        0
MntSweetProducts       0
MntGoldProds           0
NumDealsPurchases      0
NumWebPurchases        0
NumCatalogPurchases    0
NumStorePurchases      0
NumWebVisitsMonth      0
AcceptedCmp3           0
AcceptedCmp4           0
AcceptedCmp5           0
AcceptedCmp1           0
AcceptedCmp2           0
Complain               0
Z_CostContact          0
Z_Revenue              0
Response               0
dtype: int64

In [7]:
# set objek yang akan dilakukan test dengan anova
df_graduation = df[df['Education'] == 'Graduation']
df_phd = df[df['Education'] == 'PhD']
df_master = df[df['Education'] == 'Master']
df_basic = df[df['Education'] == 'Basic']
df_2ncycle = df[df['Education'] == '2n Cycle']

In [10]:
# Test ANOVA
anova_test = st.f_oneway(df_graduation['Income'],
                         df_phd['Income'],
                         df_master['Income'],
                         df_basic['Income'],
                         df_2ncycle['Income'],)

In [11]:
#hitung p-value
anova_test.pvalue

1.075202108156874e-22

In [12]:
#keputusan  hipotesis

if anova_test.pvalue>0.05:
    print('Education tidak berpengaruh signifikan terhadap Income')
else:
    print('Education berpengaruh signifikan terhadap Income')

Education berpengaruh signifikan terhadap Income

**Berdasarkan kepercayaan alpha = 0,05, maka tolak Ho --> Education berpengaruh signifikan terhadap Income**